/**
 * 这是网页的文章内容JS脚本
 * 通过获取此处内容加入网页
 * @author _dongbob_
 */


/*中国共产党简介*/
document.getElementById("p_info").innerHTML=
"&nbsp&nbsp&nbsp&nbsp中国共产党领导中国"+
"人民进行了反对帝国主义、封建主义和官僚资"+
"本主义的新民主主义革命，建立了工人阶级领"+
"导的、以工农联盟为基础的人民民主专政的社"+
"会主义国家。它是中国工人阶级的先锋队，同"+
"时是中国人民和中华民族的先锋队，是中国特"+
"色社会主义事业的领导核心，代表中国先进生"+
"产力的发展要求，代表中国先进文化的前进方"+
"向，代表中国最广大人民的根本利益。党的最"+
"高理想和最终目标是实现共产主义。";


/*党的领导下*/
document.getElementById("p_hs1").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1917年，十月革命的"+
"曙光照亮了世界。在十月革命的影响下，中国"+
"以李大钊、陈独秀、毛泽东为代表的先进知识"+
"分子，开始了学习宣传马克思主义的活动。于"+
"是，马克思主义在中国先进知识分子当中，逐"+
"步传播开来。";

document.getElementById("p_hs2").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1921年7月初，中国共"+
"产党第一次全国代表大会在南湖的一艘画舫上"+
"完成了最后的议程，庄严宣告中国共产党成立"+
"。南湖从此成为党的诞生地，全国人民向往的"+
"革命圣地，中国红色旅游之源。";

document.getElementById("p_hs3").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1922年1月到1923年2"+
"月，中国工人运动出现了第一次高潮。同时，"+
"建立了以共产党员和国民党左派为核心的国共"+
"两党和各界人民的革命统一战线，联合一切可"+
"以联合的力量，迅速地掀起了1925年至1927年"+
"的大革命高潮，胜利地举行了北伐战争，基本"+
"上摧毁了北洋军阀的反动统治。";

document.getElementById("p_hs4").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1927年8月1日，周恩"+
"来等领导的南昌起义，打响了武装反抗国民党"+
"反动派的第一枪。8月7日，党中央召开紧急会"+
"议，确定了实行土地革命和武装起义的方针。"+
"9月，毛泽东同湖南省委领导了湖南、江西边界"+
"的秋收起义。随后，湘鄂赣粤各地的秋收起义"+
"，广州起义和其他许多地区的起义先后爆发。"+
"自1927年大革命失败到1928年，党在全国各地"+
"领导武装起义100多次，开始进入创建红军和发"+
"动土地革命的新时期。";

document.getElementById("p_hs5").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1937年7月，抗日战争"+
"爆发，针对当时实际情况，毛泽东同志多次重"+
"申党的二大提出的关于中国革命分两步走的规"+
"化，提出了新民主主义革命的光辉思想，指出"+
"了中国的出路在于推翻帝国主义、封建主义的"+
"反动统治，并进而转入社会主义。";

document.getElementById("p_hs6").innerHTML=
"&nbsp&nbsp&nbsp&nbsp1946年6月底，国民党"+
"统治集团，悍然发动全面内战。人民解放军在"+
"中国共产党的领导下，挫败国民党的军事进攻"+
"，并转入战略进攻。解放区开展土地改革运动"+
"，广大农民踊跃支援前线。";


/*国家的成就*/
//两弹一星
document.getElementById("p_ach1").innerHTML=
"&nbsp&nbsp&nbsp&nbsp“两弹一星”中的一弹是"+
"原子弹和氢弹；另一弹是导弹，一星则是人造"+
"地球卫星。<br>"+

"&nbsp&nbsp&nbsp&nbsp1964年10月16日，中"+
"国第一颗原子弹爆炸成功；<br>"+

"&nbsp&nbsp&nbsp&nbsp1967年6月17日，中国"+
"第一颗氢弹空爆试验成功；<br>"+

"&nbsp&nbsp&nbsp&nbsp1970年4月24日，中国"+
"第一颗人造卫星“东方红一号”发射成功，在宇"+
"宙中唱响了东方红歌曲。";

//杂交水稻
document.getElementById("p_ach2").innerHTML=
"&nbsp&nbsp&nbsp&nbsp袁隆平于1971年2月调"+
"到湖南省农业科学院专门从事杂交水稻研究工作"+
"。1973年，以他为首的科技攻关组完成了三系配"+
"套并成功培育杂交水稻，实现了杂交水稻的历史"+
"性突破。1984年6月成立了全国性的杂交水稻专"+
"门研究机构——湖南杂交水稻研究中心，后又成立"+
"国家杂交水稻工程技术研究中心，均由袁隆平任"+
"中心主任 。1986年提出“两系法亚种间杂种优势"+
"利用”的发展观点，经6年艰难攻关，与研究人员"+
"成功地突破了两系杂交稻关键技术并推广应用，"+
"取得了良好的增产效果。";

//载人航天
document.getElementById("p_ach3").innerHTML=
"&nbsp&nbsp&nbsp&nbsp神舟五号飞船搭载航天"+
"员杨利伟于北京时间2003年10月15日9时整在酒"+
"泉卫星发射中心发射，在轨运行14圈，历时21小"+
"时23分，其返回舱于北京时间2003年10月16日6"+
"时23分返回内蒙古主着陆场，其轨道舱留轨运行半年";

//中国天眼
document.getElementById("p_ach4").innerHTML=
"&nbsp&nbsp&nbsp&nbsp500米口径球面射电望"+
"远镜,俗称“天眼”，于2011年3月25日动工兴建"+
"，于2016年9月25日进行落成启动仪式，该科"+
"技基础设施进入试运行、试调试工作于2020年"+
"1月11日通过中国国家验收工作，正式开放运"+
"行。<br>"+

"&nbsp&nbsp&nbsp&nbsp它的反射面相当于30"+
"个足球场的射电望远镜，灵敏度达到世界第二"+
"大望远镜的2.5倍以上，大幅拓展人类的视野"+
"，用于探索宇宙起源和演化，开创了建造巨型"+
"望远镜的新模式";

//蛟龙深潜
document.getElementById("p_ach5").innerHTML=
"&nbsp&nbsp&nbsp&nbsp蛟龙号载人潜水器是"+
"一艘由中国自行设计、自主集成研制的载人潜"+
"水器，也是863计划中的一个重大研究专项。2"+
"010年5月至7月，蛟龙号载人潜水器在中国南"+
"海中进行了多次下潜任务，最大下潜深度达到"+
"了7020米。";

//神威·太湖之光
document.getElementById("p_ach6").innerHTML=
"&nbsp&nbsp&nbsp&nbsp“神威·太湖之光”超级计"+
"算机是由国家并行计算机工程技术研究中心研"+
"制，安装在国家超级计算无锡中心的超级计算"+
"机，安装了40960个中国自主研发的神威2601"+
"0众核处理器，该众核处理器采用64位自主申威"+
"指令系统，峰值性能3,168万亿次每秒，核心"+
"工作频率1.5GHz";

//东风导弹
document.getElementById("p_ach7").innerHTML=
"&nbsp&nbsp&nbsp&nbsp东风系列导弹，是中"+
"华人民共和国一系列近程、中远程和洲际弹道导弹。";

//东风导弹
document.getElementById("p_ach8").innerHTML=
"&nbsp&nbsp&nbsp&nbsp辽宁号航空母舰前身"+
"是苏联海军的库兹涅佐夫元帅级航空母舰次舰"+
"瓦良格号，20世纪80年代中后期，建造工程中"+
"断，完成度68%。1999年，中国购买了瓦良格"+
"号，于2002年3月4日抵达大连港。2005年4月"+
"26日，开始由中国海军继续建造改进。解放军"+
"的目标是对此艘未完成建造的航空母舰进行更"+
"改制造，及将其用于科研、实验及训练用途。"+
"2012年9月25日，正式更名辽宁号，交付予中"+
"国人民解放军海军。";

//结束语
document.getElementById("p_ms1").innerHTML=
"&nbsp&nbsp&nbsp&nbsp在党的领导之下，国"+
"家的成就我们有目共睹!<br>"+

"&nbsp&nbsp&nbsp&nbsp我们要争做担当民族复"+
"兴大任的时代新人!";